---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarGeometryType
source: html/7af9014f-a806-b38e-b588-1595d2016d8d.htm
---
# Autodesk.Revit.DB.Structure.RebarGeometryType

Rebar geometry type

## Syntax (C#)
```csharp
public enum RebarGeometryType
```